In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns


df = pd.read_csv("C:\\Users\\ajroy\\OneDrive\\Desktop\\New folder\\zomato_EDA\\data\\zomato.csv")
df.head()

,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),listed_in(type)
0,"942, 21st Main Road, 2nd Stage, Banashankari, ...",Jalsa,Yes,Yes,4.1/5,775,080 42297555\r\n+91 9743772233,Banashankari,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,Buffet
1,"2nd Floor, 80 Feet Road, Near Big Bazaar, 6th ...",Spice Elephant,Yes,No,4.1/5,787,080 41714161,Banashankari,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,Buffet
2,"1112, Next to KIMS Medical College, 17th Cross...",San Churro Cafe,Yes,No,3.8/5,918,+91 9663487993,Banashankari,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,Buffet
3,"1st Floor, Annakuteera, 3rd Stage, Banashankar...",Addhuri Udupi Bhojana,No,No,3.7/5,88,+91 9620009302,Banashankari,Quick Bites,Masala Dosa,"South Indian, North Indian",300,Buffet
4,"10, 3rd Floor, Lakshmi Associates, Gandhi Baza...",Grand Village,No,No,3.8/5,166,+91 8026612447\r\n+91 9901210005,Basavanagudi,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,Buffet

In [4]:
# my dataset  column
df.columns

Index(['address', 'name', 'online_order', 'book_table', 'rate', 'votes',
       'phone', 'location', 'rest_type', 'dish_liked', 'cuisines',
       'approx_cost(for two people)', 'listed_in(type)'],
      dtype='object')

In [5]:
# my dataset info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56252 entries, 0 to 56251
Data columns (total 13 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   address                      56235 non-null  object
 1   name                         56236 non-null  object
 2   online_order                 56233 non-null  object
 3   book_table                   56194 non-null  object
 4   rate                         48414 non-null  object
 5   votes                        56174 non-null  object
 6   phone                        54956 non-null  object
 7   location                     56126 non-null  object
 8   rest_type                    55914 non-null  object
 9   dish_liked                   28027 non-null  object
 10  cuisines                     56049 non-null  object
 11  approx_cost(for two people)  55731 non-null  object
 12  listed_in(type)              51642 non-null  object
dtypes: object(13)
memory usage: 5.6+ MB

In [6]:
# my dataset describe
df.describe()

,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),listed_in(type)
count,56235,56236,56233,56194,48414,56174,54956,56126,55914,28027,56049,55731,51642
unique,13397,11914,2639,2902,2877,5195,17712,2920,2961,8067,5553,2879,2783
top,('Rated 4.0',('Rated 4.0',Yes,No,NEW,0,('Rated 4.0',BTM,Quick Bites,('Rated 4.0',North Indian,300,Delivery
freq,942,300,30444,45268,2208,10027,412,5125,19132,407,2913,7576,24317

In [7]:
# my dataset shape
df.shape

(56252, 13)

In [8]:
# my dataset isnull
df.isnull().sum()

address                           17
name                              16
online_order                      19
book_table                        58
rate                            7838
votes                             78
phone                           1296
location                         126
rest_type                        338
dish_liked                     28225
cuisines                         203
approx_cost(for two people)      521
listed_in(type)                 4610
dtype: int64

In [14]:
# dropping the 'dish_liked' column as it contains more than 50% missing values
df = df.drop('dish_liked', axis=1)

In [20]:
# --- Convert numeric columns from string to int/float safely ---

# Remove commas and convert 'votes' to numeric
df['votes'] = df['votes'].astype(str).str.replace(',', '', regex=True)
df['votes'] = pd.to_numeric(df['votes'], errors='coerce')

# Remove commas and convert 'approx_cost(for two people)' to numeric
df['approx_cost(for two people)'] = df['approx_cost(for two people)'].astype(str).str.replace(',', '', regex=True)
df['approx_cost(for two people)'] = pd.to_numeric(df['approx_cost(for two people)'], errors='coerce')

In [23]:
# --- Fill missing values ---

df['votes'] = df['votes'].fillna(df['votes'].mean())
df['approx_cost(for two people)'] = df['approx_cost(for two people)'].fillna(df['approx_cost(for two people)'].median())
df['rest_type'] = df['rest_type'].fillna(df['rest_type'].mode()[0])
df['location'] = df['location'].fillna(df['location'].mode()[0])

In [9]:
# checking for duplicate values
df.duplicated().sum()

np.int64(15703)

In [13]:
# dropping duplicate values
df.drop_duplicates(inplace=True)
print("After removing duplicates, the new shape is:", df.shape)

After removing duplicates, the new shape is: (40549, 13)

In [25]:
#checking final missing values
df.isnull().sum()

address                           2
name                              1
online_order                      4
book_table                       38
rate                           4145
votes                             0
phone                           808
location                          0
rest_type                         0
cuisines                        151
approx_cost(for two people)       0
listed_in(type)                2907
dtype: int64

In [27]:


# Clean the 'rate' column safely

# 1️⃣ Convert everything to string and strip extra spaces
df['rate'] = df['rate'].astype(str).str.strip()

# 2️⃣ Remove '/5' part if present
df['rate'] = df['rate'].str.replace('/5', '', regex=False)

# 3️⃣ Replace unwanted text values (like 'NEW', '-', 'nan', 'Top floor', etc.) with NaN
df['rate'] = df['rate'].replace(
    ['NEW', '-', 'nan', 'Top floor', 'Excellent', 'High Floor', 'Ground Floor', 'None', ''],
    np.nan
)

# 4️⃣ Remove any non-numeric values using regex
df['rate'] = df['rate'].str.extract('(\d+\.\d+|\d+)')  # extract only numbers like 4.1 or 4

# 5️⃣ Convert to float
df['rate'] = df['rate'].astype(float)

# 6️⃣ Fill missing values with mean or median
df['rate'] = df['rate'].fillna(df['rate'].mean())

# 7️⃣ (Optional) Round to 1 decimal place
df['rate'] = df['rate'].round(1)

In [30]:
#checking the 'rate' column after cleaning
df['rate'].isnull().sum()  
df['rate'].head()           
df['rate'].dtype

dtype('float64')

In [31]:
df['rate'].head()

0    4.1
1    4.1
2    3.8
3    3.7
4    3.8
Name: rate, dtype: float64